<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"9b6cb22e1eb7e1ba959397e4d63cf64cec8b28d63185515397cb2c188f9b25ef","plan_job_ref":"Job Pull Request Checks #4790 at https://github.com/GSA-TTS/FAC/actions/runs/15345734343","plan_out_hash":"e038d3553f62c7f877217c453c14c1b56f550928059e418dd985a5b08c6fed15","plan_hash":"65c72da3808c0dfcc443f25adf8e97aa540cfc52ce5dd3b68ee0e76f77be8c3e","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 3 to add, 15 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.dev.cloudfoundry_app.postgrest will be updated in-place
!~  resource "cloudfoundry_app" "postgrest" {
+       buildpacks                  = (known after apply)
!~      created_at                  = "2025-04-21T18:49:18Z" -> (known after apply)
!~      docker_image                = "ghcr.io/gsa-tts/fac/postgrest@sha256:80cb7dbcf58efcc5d65ff0a62ef012a8cf3b9959b751d2a548132796468a9123" -> "ghcr.io/gsa-tts/fac/postgrest@sha256:00baef2eb02650bb6e7f37547a7d715079b619f453a219b95ba4e15d5bb9596e"
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "postgrest"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-dev-postgrest.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      stack                       = null -> (known after apply)
!~      updated_at                  = "2025-04-28T16:21:49Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.dev.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
        id = "99884884-59ae-8864-786d-a5e33d1b1455"

-       policy {
-           destination_app = "caa8e542-9d7e-438d-a17c-3af19b05eaa6" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "d7fcdc7a-fd97-4e31-89ae-b823883b5992" -> null
        }
-       policy {
-           destination_app = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "a0669f56-c5a5-4c35-85bf-5b6201478ad5" -> null
        }
-       policy {
-           destination_app = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "d7fcdc7a-fd97-4e31-89ae-b823883b5992" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "a0669f56-c5a5-4c35-85bf-5b6201478ad5"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "d7fcdc7a-fd97-4e31-89ae-b823883b5992"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "d7fcdc7a-fd97-4e31-89ae-b823883b5992"
        }
    }

  # module.dev.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
        id = "30fc72e9-9a5e-c40d-140c-98bc1b576989"

-       policy {
-           destination_app = "caa8e542-9d7e-438d-a17c-3af19b05eaa6" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "6eab89ac-271f-4193-893f-cfa1f590f3d9" -> null
        }
-       policy {
-           destination_app = "caa8e542-9d7e-438d-a17c-3af19b05eaa6" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.dev.cloudfoundry_network_policy.logshipper-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "logshipper-network-policy" {
        id = "f188b467-82e6-e5d6-bae1-138086a288c5"

-       policy {
-           destination_app = "caa8e542-9d7e-438d-a17c-3af19b05eaa6" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "92483ac7-d368-43b0-b429-0170e3e2b2c2" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.dev.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
        id = "1c06d5ba-733a-e0a1-8eb6-d577a1347e2b"

-       policy {
-           destination_app = "6eab89ac-271f-4193-893f-cfa1f590f3d9" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "a0669f56-c5a5-4c35-85bf-5b6201478ad5" -> null
        }
-       policy {
-           destination_app = "caa8e542-9d7e-438d-a17c-3af19b05eaa6" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "a0669f56-c5a5-4c35-85bf-5b6201478ad5" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.dev.cloudfoundry_route.postgrest will be updated in-place
!~  resource "cloudfoundry_route" "postgrest" {
!~      destinations = [
-           {
-               app_id           = "c1ba2481-d372-4e4e-9bb8-1f53a86f065d" -> null
-               app_process_type = "web" -> null
-               id               = "70ac0252-a838-4716-b4f4-54307902ffcc" -> null
-               port             = 3000 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "fd2a07e7-c167-4d36-a9bc-ccac564ae2d5"
!~      updated_at   = "2025-04-21T18:49:24Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.dev.module.cg-logshipper.cloudfoundry_app.logshipper_app will be updated in-place
!~  resource "cloudfoundry_app" "logshipper_app" {
!~      created_at                  = "2025-04-21T18:47:16Z" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "logshipper"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-dev-logshipper.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "3de51d5be398426d06e6c738d964af3c631a368a1dcd68a58dc8212c56c5b9b9" -> "28f7a0bda5e5ef3edbd3f5a6308c42703bb9d2bff793be4acee0c0dae9887158"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-05-28T20:21:17Z" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

  # module.dev.module.cg-logshipper.cloudfoundry_route.logshipper_route will be updated in-place
!~  resource "cloudfoundry_route" "logshipper_route" {
!~      destinations = [
-           {
-               app_id           = "92483ac7-d368-43b0-b429-0170e3e2b2c2" -> null
-               app_process_type = "web" -> null
-               id               = "cb430c0b-be04-428f-b94f-0af6d42d100b" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "3aec8f3f-c16b-4528-bc10-021921a7c5c6"
!~      updated_at   = "2025-04-21T18:49:17Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.dev.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:22:42Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:631e0ec843a85e2ea8d97eaae565b488a06db44e24ead5155af06573957c9023" -> "ghcr.io/gsa-tts/fac/clamav@sha256:a91de4d279315089f5466d4e5a47adb4ce39d7f7108f2e466cd7d46fc4849996"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-dev"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-dev.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-04-28T15:34:12Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.dev.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-04-30T21:36:37Z" -> (known after apply)
        }
    }

  # module.dev.module.fac-file-scanner.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.dev.module.fac-file-scanner.data.external.scannerzip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "scannerzip" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "prepare-scanner.sh",
        ]
+       query       = {
+           "gitref" = "refs/heads/main"
        }
+       result      = (known after apply)
+       working_dir = "../shared/modules/scanner"
    }

  # module.dev.module.fac-file-scanner.cloudfoundry_app.scanner_app will be updated in-place
!~  resource "cloudfoundry_app" "scanner_app" {
!~      created_at                  = "2025-04-21T18:53:54Z" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "fac-file-scanner"
!~      path                        = "../shared/modules/scanner/scanner.zip" -> (known after apply)
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-file-scanner-dev.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "c7af0a37e63f0545429647139e6cd329de697b1cef624f87e36f4db851db4ee2" -> (known after apply)
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-04-23T13:51:54Z" -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.dev.module.fac-file-scanner.cloudfoundry_route.scanner_route must be replaced
-/+ resource "cloudfoundry_route" "scanner_route" {
!~      created_at   = "2025-04-23T13:51:55Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "a0669f56-c5a5-4c35-85bf-5b6201478ad5" -> null
-               app_process_type = "web" -> null
-               id               = "49d9796a-1464-4a9a-b05f-d81f12d4607e" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      updated_at   = "2025-04-23T13:51:55Z" -> (known after apply)
!~      url          = "fac-file-scanner-dev.apps.internal" -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # module.dev.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:22:42Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:631e0ec843a85e2ea8d97eaae565b488a06db44e24ead5155af06573957c9023" -> "ghcr.io/gsa-tts/fac/clamav@sha256:a91de4d279315089f5466d4e5a47adb4ce39d7f7108f2e466cd7d46fc4849996"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-dev-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-dev-fs.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-04-28T15:34:12Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.dev.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2025-04-21T18:44:40Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "https-proxy"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "gsa-tts-oros-fac-dev-egress-https-proxy.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "b484469dcfb5672a2891b928bf55728283205ede65f1c1322f0514d2eecae40b" -> "3d2b5f8f666c8db20d827f80aab549c465cdc67d52cf32c760a08d9ae371a09d"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-05-28T19:23:44Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.dev.module.https-proxy.cloudfoundry_route.egress_route will be updated in-place
!~  resource "cloudfoundry_route" "egress_route" {
!~      destinations = [
-           {
-               app_id           = "caa8e542-9d7e-438d-a17c-3af19b05eaa6" -> null
-               app_process_type = "web" -> null
-               id               = "2bf104be-d294-4864-a5e1-49d08e420a04" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "13dc80b5-4d3b-4181-b7c1-b6dc8d5a0e65"
!~      updated_at   = "2025-04-21T18:44:56Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.dev.module.clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> null
-               app_process_type = "web" -> null
-               id               = "3253c01b-5425-4c19-822d-c60fe6ee7ed4" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "877bbc1f-e036-4a96-b7a3-70cff8c35c3c"
!~      updated_at   = "2025-04-21T18:47:15Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.dev.module.fac-file-scanner.module.quarantine.data.cloudfoundry_service_plans.s3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service_plans" "s3" {
+       name                  = "basic"
+       service_offering_name = "s3"
+       service_plans         = (known after apply)
    }

  # module.dev.module.fac-file-scanner.module.quarantine.cloudfoundry_service_instance.bucket will be updated in-place
!~  resource "cloudfoundry_service_instance" "bucket" {
+       dashboard_url     = (known after apply)
        id                = "c435cb9c-32a7-4a31-828b-48c8c6f3bf37"
!~      last_operation    = {
!~          created_at  = "2025-03-14T14:22:42Z" -> (known after apply)
+           description = (known after apply)
!~          state       = "succeeded" -> (known after apply)
!~          type        = "update" -> (known after apply)
!~          updated_at  = "2025-03-14T14:22:42Z" -> (known after apply)
        } -> (known after apply)
!~      maintenance_info  = {
+           description = (known after apply)
+           version     = (known after apply)
        } -> (known after apply)
        name              = "fac-file-scanner-quarantine"
!~      service_plan      = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806" -> (known after apply)
        tags              = [
            "s3",
            "terraform-cloudgov-managed",
        ]
!~      updated_at        = "2025-03-14T14:22:42Z" -> (known after apply)
!~      upgrade_available = false -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # module.dev.module.file_scanner_clamav.module.route.data.cloudfoundry_domain.domain will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "domain" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.dev.module.file_scanner_clamav.module.route.data.cloudfoundry_org.org will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_org" "org" {
+       annotations = (known after apply)
+       created_at  = (known after apply)
+       id          = (known after apply)
+       labels      = (known after apply)
+       name        = "gsa-tts-oros-fac"
+       quota       = (known after apply)
+       suspended   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.dev.module.file_scanner_clamav.module.route.data.cloudfoundry_space.space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "space" {
+       allow_ssh         = (known after apply)
+       annotations       = (known after apply)
+       created_at        = (known after apply)
+       id                = (known after apply)
+       isolation_segment = (known after apply)
+       labels            = (known after apply)
+       name              = "dev"
+       org               = (known after apply)
+       quota             = (known after apply)
+       updated_at        = (known after apply)
    }

  # module.dev.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route must be replaced
-/+ resource "cloudfoundry_route" "app_route" {
!~      created_at   = "2025-04-23T13:51:56Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "6eab89ac-271f-4193-893f-cfa1f590f3d9" -> null
-               app_process_type = "web" -> null
-               id               = "c835e4b1-d935-431f-915a-f9510fa15dce" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      space        = "06525ba3-19c2-451b-96e9-ea4a9134e8b9" -> (known after apply) # forces replacement
!~      updated_at   = "2025-04-23T13:51:56Z" -> (known after apply)
!~      url          = "fac-av-dev-fs.apps.internal" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

Plan: 3 to add, 15 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4790](https://github.com/GSA-TTS/FAC/actions/runs/15345734343)